{
  "muscleGroups": {
    "chest": "Chest",
    "legs": "Legs",
    "back": "Back",
    "shoulders": "Shoulders",
    "biceps": "Biceps",
    "triceps": "Triceps",
    "abs": "Abs",
    "forearms": "Forearms"
  },
  "equipment": {
    "bodyweight": "Bodyweight",
    "bench": "Bench",
    "dumbbell": "Dumbbell",
    "barbell": "Barbell",
    "kettlebell": "Kettlebell",
    "machine": "Machine",
    "pull-up-bar": "Pull-up Bar",
    "cable": "Cable",
    "none": "None"
  },
  "bench-press": {
    "name": "Bench Press",
    "description": "The bench press is a compound exercise that targets the chest, shoulders, and triceps."
  },
  "push-up": {
    "name": "Push Ups",
    "description": "Push-ups are a bodyweight exercise that strengthens the chest, shoulders, and core."
  },
  "dumbbell-bench-press": {
    "name": "Dumbbell Bench Press",
    "description": "The dumbbell bench press is a compound exercise that targets the chest, shoulders, and triceps using dumbbells."
  },
  "dumbbell-fly": {
    "name": "Dumbbell Fly",
    "description": "The dumbbell fly is an isolation exercise that targets the chest muscles using dumbbells."
  },
  "dumbbell-incline-press": {
    "name": "Dumbbell Incline Press",
    "description": "The dumbbell incline press is a compound exercise that targets the upper chest, shoulders, and triceps using dumbbells."
  },
  "high-cable-crossover": {
    "name": "High Cable Crossover",
    "description": "The high cable crossover is an isolation exercise that targets the upper chest muscles using a cable machine."
  },
  "low-cable-crossover": {
    "name": "Low Cable Crossover",
    "description": "The low cable crossover is an isolation exercise that targets the lower chest muscles using a cable machine."
  },
  "pec-deck-fly": {
    "name": "Pec Deck Fly",
    "description": "The pec deck fly is an isolation exercise that targets the chest muscles using a pec deck machine."
  },
  "chest-dips": {
    "name": "Chest Dips",
    "description": "Chest dips are a bodyweight exercise that targets the lower chest, triceps, and shoulders."
  },
  "squat": {
    "name": "Squats",
    "description": "The squat is a fundamental lower body exercise targeting the quadriceps, hamstrings, and glutes."
  },
  "deadlift": {
    "name": "Deadlift",
    "description": "The deadlift is a compound exercise that targets the entire posterior chain, including the back, glutes, and hamstrings."
  },
  "lat-pulldown": {
    "name": "Lat Pulldown",
    "description": "The lat pulldown is an exercise that targets the latissimus dorsi muscles in the back."
  },
  "seated-cable-row": {
    "name": "Seated Cable Row",
    "description": "The seated cable row is an exercise that targets the muscles of the upper back and biceps."
  },
  "closegrip-cable-row": {
    "name": "Close-Grip Cable Row",
    "description": "The close-grip cable row is an exercise that targets the middle back and biceps using a close grip."
  },
  "pushdown": {
    "name": "Tricep Pushdown",
    "description": "The tricep pushdown is an isolation exercise that targets the triceps muscles using a cable machine."
  },
  "dumbbell-curl": {
    "name": "Dumbbell Curl",
    "description": "The dumbbell curl is an isolation exercise that targets the biceps muscles using dumbbells."
  },
  "barbell-curl": {
    "name": "Barbell Curl",
    "description": "The barbell curl is an isolation exercise that targets the biceps muscles using a barbell."
  },
  "dumbbell-lateral-raise": {
    "name": "Dumbbell Lateral Raise",
    "description": "The dumbbell lateral raise is an isolation exercise that targets the shoulder muscles, specifically the lateral deltoids."
  }
}
