{
  "muscleGroups": {
    "chest": "Chest",
    "legs": "Legs",
    "back": "Back",
    "shoulders": "Shoulders",
    "biceps": "Biceps",
    "triceps": "Triceps",
    "abs": "Abs",
    "forearms": "Forearms"
  },
  "equipment": {
    "bodyweight": "Bodyweight",
    "bench": "Bench",
    "dumbbell": "Dumbbell",
    "barbell": "Barbell",
    "kettlebell": "Kettlebell",
    "machine": "Machine",
    "pull-up-bar": "Pull-up Bar",
    "cable": "Cable",
    "none": "None"
  },
  "bench-press": {
    "name": "Bench Press",
    "description": "The bench press is a compound exercise that targets the chest, shoulders, and triceps. Overall, the bench press effectively targets multiple muscle groups in the upper body and is a valuable addition to any strength training routine."
  },
  "dumbbell-bench-press": {
    "name": "Dumbbell Bench Press",
    "description": "The dumbbell bench press is a compound exercise that targets the chest using dumbbells. Your chest muscle are the main muscles targeted by the exercise, but as an added bonus it also works your anterior deltoid and triceps."
  },
  "incline-barbell-press": {
    "name": "Incline Barbell Press",
    "description": "The incline barbell press is a compound exercise that targets the upper chest, shoulders, and triceps. The movement is typically performed on an incline bench raised at an angle of about 30 to 45 degrees."
  },
  "dumbbell-incline-press": {
    "name": "Dumbbell Incline Press",
    "description": "The dumbbell incline press is a compound exercise that targets the upper chest, shoulders, and triceps using dumbbells. It is performed on an incline bench set at a 30-45 degree angle."
  },
  "push-up": {
    "name": "Push Ups",
    "description": "Push-ups are a bodyweight exercise that strengthens the chest, shoulders, and core."
  },
  "dumbbell-fly": {
    "name": "Dumbbell Fly",
    "description": "The dumbbell fly is an isolation exercise that targets the chest muscles using dumbbells. This exercise is commonly included in chest-focused workouts to help develop muscle definition, strength, and flexibility in the chest area."
  },
  "smith-incline-press": {
    "name": "Smith Machine Incline Press",
    "description": "The Smith machine incline press is a compound exercise that targets the upper chest, shoulders, and triceps using a Smith machine. It is performed on an incline bench set at a 30-45 degree angle."
  },
  "high-cable-crossover": {
    "name": "High Cable Crossover",
    "description": "The high cable crossover is an isolation exercise that targets the chest muscles using a cable machine. It involves using a cable machine with the pulleys set to the highest position and crossing the arms in front of the body at the end of the movement. This move targets the pecs, specifically the lower, inner and outer areas, while also working the shoulders and triceps as secondary muscles."
  },
  "low-cable-crossover": {
    "name": "Low Cable Crossover",
    "description": "The low cable crossover is an isolation exercise that targets the chest muscles, especially the upper and inner regions using a cable machine. It involves using a cable machine with the reels set to the lowest height and then crossing the arms in front of the chest while keeping the elbows slightly bent."
  },
  "pec-deck-fly": {
    "name": "Pec Deck Fly",
    "description": "The pec deck fly is an isolation exercise that targets the chest muscles using a pec deck machine. The machine acts as a stabilizer here, emphasizing the pectoralis major and pectoralis minor muscles in the chest. This isolation exercise, which combines pushing and compression movements, helps develop and strengthen the chest muscles."
  },
  "chest-dips": {
    "name": "Chest Dips",
    "description": "Chest dips are a bodyweight exercise that targets the lower chest, triceps, and shoulders. This exercise is performed using parallel bars."
  },
  "dumbbell-curl": {
    "name": "Dumbbell Curl",
    "description": "The dumbbell curl is an isolation exercise that targets the biceps muscles using dumbbells, to build muscle and strength in the arms. The exercise can be performed in a variety of ways, including alternating arms, performing both arms at the same time."
  },
  "barbell-curl": {
    "name": "Barbell Curl",
    "description": "The barbell curl is an isolation exercise that targets the biceps muscles in the upper arms using a barbell. This exercise is typically performed while standing with feet shoulder-width apart and the barbell held at arm’s length in front of the body."
  },
  "hammer-curl": {
    "name": "Hammer Curl",
    "description": "The hammer curl is an isolation exercise that targets the biceps muscles, particularly the brachialis and brachioradialis muscles, using dumbbells. The exercise is performed by holding the dumbbells with a neutral grip (palms facing each other) and curling them towards the shoulders."
  },
  "rope-hammer-curl": {
    "name": "Cable Hammer Curl",
    "description": "The cable hammer curl is an isolation exercise that targets the biceps muscles using a cable machine. The primary target of the cable hammer curl movement is the brachialis and brachioradialis muscles. The exercise is performed standing with feet shoulder-width apart and holding the cable machine with rope attachment with a neutral grip (palms facing each other)."
  },
  "cable-biceps-curl": {
    "name": "Cable Biceps Curl",
    "description": "The cable biceps curl is an isolation exercise that targets the biceps muscles using a cable machine. The primary target of cable curl movement is the biceps brachii muscle. The exercise is performed standing with feet shoulder-width apart and holding the cable machine handle with palms facing upward."
  },
  "incline-biceps-curl": {
    "name": "Incline Dumbbell Biceps Curl",
    "description": "The incline dumbbell biceps curl is an isolation exercise that targets the biceps muscles using dumbbells while lying on an incline bench. The primary target of the incline dumbbell biceps curl movement is the biceps brachii muscle. The exercise is performed by sitting on an incline bench set at a 45-degree angle and holding the dumbbells with palms facing upward."
  },
  "z-bar-curl": {
    "name": "Z-Bar Curl",
    "description": "The Z-bar curl is an isolation exercise that targets the biceps muscles using a Z-bar (EZ curl bar). The primary target of the Z-bar curl movement is the biceps brachii muscle. The exercise is performed standing with feet shoulder-width apart and holding the Z-bar with an underhand grip (palms facing upward)."
  },
  "squat": {
    "name": "Squats",
    "description": "The squat is a fundamental lower body exercise targeting the quadriceps, hamstrings, and glutes. It is a compound exercise, meaning it works multiple muscle groups simultaneously. The exercise is performed using a barbell, which is a long, straight bar that is weighted with plates."
  },
  "hack-squats": {
    "name": "Hack Squats",
    "description": "The hack squat is a compound exercise that targets the quadriceps, hamstrings, and glutes using a hack squat machine. The exercise is performed by standing on the platform of the machine with the shoulders under the pads and then squatting down while keeping the back against the backrest."
  },
  "leg-curl": {
    "name": "Leg Curl",
    "description": "The leg curl is an isolation exercise that targets the hamstring muscles using a leg curl machine. The exercise is performed by lying face down on the machine and curling the legs up towards the glutes against resistance."
  },
  "leg-extension": {
    "name": "Leg Extension",
    "description": "The leg extension is an isolation exercise that targets the quadriceps muscles using a leg extension machine. The exercise is performed by sitting on the machine with the legs bent at a 90-degree angle and extending the legs straight out against resistance."
  },
  "leg-press": {
    "name": "Leg Press",
    "description": "The leg press is a compound exercise that targets the quadriceps, hamstrings, and glutes using a leg press machine. The exercise is performed by sitting on the machine with feet shoulder-width apart on the platform and then pressing the platform away from the body by extending the legs."
  },
  "lunges": {
    "name": "Dumbbell Lunges",
    "description": "The dumbbell lunge is a compound exercise that targets the quadriceps, hamstrings, and glutes using dumbbells. The exercise is performed by stepping forward with one leg and lowering the body until the back knee nearly touches the ground, then returning to the starting position."
  },
  "deadlift": {
    "name": "Deadlift",
    "description": "The deadlift is a compound exercise that targets the entire posterior chain, including the back, glutes, and hamstrings."
  },
  "lat-pulldown": {
    "name": "Lat Pulldown",
    "description": "The lat pulldown is an exercise that targets the latissimus dorsi muscles in the back."
  },
  "seated-cable-row": {
    "name": "Seated Cable Row",
    "description": "The seated cable row is an exercise that targets the muscles of the upper back and biceps."
  },
  "closegrip-cable-row": {
    "name": "Close-Grip Cable Row",
    "description": "The close-grip cable row is an exercise that targets the middle back and biceps using a close grip."
  },
  "assisted-pull-up": {
    "name": "Assisted Pull-Up",
    "description": "The assisted pull-up is an exercise that targets the upper back and biceps using an assisted pull-up machine or resistance bands to provide support during the movement."
  },
  "pushdown": {
    "name": "Rope Pushdown",
    "description": "The rope pushdown is an isolation exercise that targets the triceps muscles using a cable machine. It targets the triceps brachii, with a focus on the lateral and long heads."
  },
  "push-down": {
    "name": "Pushdown",
    "description": "The pushdown is an isolation exercise that targets the triceps muscles using a cable machine. This movement is performed using a cable machine with a straight bar or V-bar attachment."
  },
  "incline-ezbar-triceps": {
    "name": "Incline EZ Bar Triceps Extension",
    "description": "The incline EZ bar triceps extension is an exercise that targets the triceps muscles using an EZ curl bar while lying on an incline bench. The primary target of the incline EZ bar triceps extension movement is the triceps brachii muscle. The exercise is performed by lying on an incline bench set at a 30-45 degree angle and holding the EZ curl bar with an overhand grip (palms facing downward) and extending the arms upward."
  },
  "onearm-triceps-pushdown": {
    "name": "One-Arm Triceps Pushdown",
    "description": "The one-arm triceps pushdown is an exercise that targets the triceps muscles using a cable machine. The primary target of the one-arm triceps pushdown movement is the triceps brachii muscle. The exercise is performed standing with feet shoulder-width apart and holding the cable machine handle with an overhand grip (palm facing downward) and extending the arm downward."
  },
  "lying-barbell-tricep-extension": {
    "name": "Lying Barbell Tricep Extension",
    "description": "The lying barbell tricep extension is an exercise that targets the triceps muscles using a barbell while lying on a flat bench. The primary target of the lying barbell tricep extension movement is the triceps brachii muscle. The exercise is performed by lying on a flat bench and holding the barbell with an overhand grip (palms facing downward) and extending the arms upward."
  },
  "dumbbell-skull-crushers": {
    "name": "Dumbbell Skull Crushers",
    "description": "The dumbbell skull crushers is an exercise that targets the triceps muscles by extending the elbows while lying on a flat bench. Unlike barbell variations, using dumbbells allows for a greater range of motion, reducing strain on the wrists and promoting muscle balance."
  },
  "triceps-dips": {
    "name": "Triceps Dips",
    "description": "Triceps dipsare one of the most effective bodyweight exercises for building upper-body strength and muscle definition. Primarily targets the triceps but also the chest, shoulders and core. This exercise is performed using parallel bars or a dip station."
  },
  "dumbbell-lateral-raise": {
    "name": "Dumbbell Lateral Raise",
    "description": "The dumbbell lateral raise is an isolation exercise that targets the shoulder muscles, specifically the lateral deltoids."
  },
  "cable-lateral-raise": {
    "name": "Cable Lateral Raise",
    "description": "The cable lateral raise is an exercise that targets the shoulder muscles, specifically the lateral deltoids, using a cable machine. The cable lateral raise involves raising your arm out to the side using a low cable pulley and handle attachment. This exercise provides constant tension on the shoulder muscles throughout the movement, making it an effective way to build strength and definition in the shoulders."
   },
   "front-raise": {
     "name": "Front Raise",
     "description": "The front raise is an isolation exercise that targets the shoulder muscles, specifically the anterior deltoids. The front raise is performed by holding a weight (such as a dumbbell or barbell) in front of the body with an overhand grip and lifting it straight up to shoulder height while keeping the arms extended."
   },
   "dumbbell-shoulder-press": {
     "name": "Dumbbell Shoulder Press",
     "description": "The dumbbell shoulder press is a compound exercise that targets the shoulder muscles using dumbbells. The primary target of the dumbbell shoulder press movement is the deltoid muscles, with a focus on the anterior (front) deltoids. The exercise is performed by sitting or standing with feet shoulder-width apart and holding the dumbbells at shoulder height with palms facing forward, then pressing the dumbbells overhead until the arms are fully extended."
   },
   "lever-shoulder-press": {
     "name": "Lever Shoulder Press",
     "description": "The lever shoulder press is a compound exercise that targets the shoulder muscles using a lever machine. The primary target of the lever shoulder press movement is the deltoid muscles, with a focus on the anterior (front) deltoids. The exercise is performed by sitting on the machine with feet flat on the floor and gripping the handles at shoulder height, then pressing the handles overhead until the arms are fully extended."
   },
   "military-press": {
     "name": "Military Press",
     "description": "The military press is a compound exercise that targets the shoulder muscles using a barbell. The primary target of the military press movement is the deltoid muscles, with a focus on the anterior (front) deltoids. The exercise is performed by standing with feet shoulder-width apart and holding the barbell at shoulder height with an overhand grip, then pressing the barbell overhead until the arms are fully extended."
   }
}
