{
  "muscleGroups": {
    "chest": "Hrudník",
    "legs": "Nohy",
    "back": "Chrbát",
    "shoulders": "Ramená",
    "biceps": "Biceps",
    "triceps": "Triceps",
    "abs": "Brušné svaly",
    "forearms": "Predlaktia"
  },
  "equipment": {
    "bodyweight": "Vlastná váha",
    "bench": "Lavica",
    "dumbbell": "Činka",
    "barbell": "Hriadeľová činka",
    "kettlebell": "Kettlebell",
    "machine": "Stroj",
    "pull-up-bar": "Hrazda",
    "cable": "Kábel",
    "none": "Žiadne"
  },
  "bench-press": {
    "name": "Tlaky na lavičke",
    "description": "Tlaky na lavičke sú komplexné cvičenie, ktoré zacieľuje na hrudník, ramená a tricepsy. Celkovo tlaky na lavičke efektívne zacieľujú na viacero svalových skupín hornej časti tela a sú cenným doplnkom každej silovej tréningovej rutiny."
  },
  "dumbbell-bench-press": {
    "name": "Tlaky na lavičke s činkami",
    "description": "Tlaky na lavičke s činkami sú komplexné cvičenie, ktoré zacieľuje na hrudník pomocou činiek. Svaly hrudníka sú hlavnými svalmi, na ktoré cvičenie cieli, ale ako pridaný bonus tiež posilňuje predný deltový sval a tricepsy."
  },
  "incline-barbell-press": {
    "name": "Tlaky na šikmej lavičke s hriadeľovou činkou",
    "description": "Tlaky na šikmej lavičke s hriadeľovou činkou sú komplexné cvičenie, ktoré zacieľuje na horný hrudník, ramená a tricepsy. Pohyb sa zvyčajne vykonáva na šikmej lavičke zdvihnutej v uhle približne 30 až 45 stupňov."
  },
  "dumbbell-incline-press": {
    "name": "Tlaky na šikmej lavičke s činkami",
    "description": "Tlaky na šikmej lavičke s činkami sú komplexné cvičenie, ktoré zacieľuje na horný hrudník, ramená a tricepsy pomocou činiek. Cvičí sa na šikmej lavičke nastavenej v uhle 30-45 stupňov."
  },
  "push-up": {
    "name": "Kliky",
    "description": "Kliky sú cvičenie s vlastnou hmotnosťou, ktoré posilňuje hrudník, ramená a jadro."
  },
  "dumbbell-fly": {
    "name": "Rozpažovanie s činkami",
    "description": "Rozpažovanie s činkami je izolačné cvičenie, ktoré zacieľuje na svaly hrudníka pomocou činiek. Toto cvičenie je bežne zahrnuté v tréningoch zameraných na hrudník, aby pomohlo rozvíjať svalovú definíciu, silu a flexibilitu v oblasti hrudníka."
  },
  "smith-incline-press": {
    "name": "Tlaky na šikmej lavičke na Smithovom stroji",
    "description": "Tlaky na šikmej lavičke na Smithovom stroji sú komplexné cvičenie, ktoré zacieľuje na horný hrudník, ramená a tricepsy pomocou Smithovho stroja. Cvičí sa na šikmej lavičke nastavenej v uhle 30-45 stupňov."
  },
  "high-cable-crossover": {
    "name": "Vysoký kríž na kladke",
    "description": "Vysoký kríž na kladke je izolačné cvičenie, ktoré zacieľuje na svaly hrudníka pomocou kladkového stroja. Zahŕňa použitie kladkového stroja s kladkami nastavenými na najvyššiu pozíciu a kríženie rúk pred telom na konci pohybu. Tento pohyb zacieľuje na prsné svaly, konkrétne na dolné, vnútorné a vonkajšie oblasti, pričom ako sekundárne svaly posilňuje aj ramená a tricepsy."
  },
   "low-cable-crossover": {
    "name": "Nízky kríž na kladke",
    "description": "Nízky kríž na kladke je izolačné cvičenie, ktoré zacieľuje na svaly hrudníka, najmä na horné a vnútorné oblasti pomocou kladkového stroja. Zahŕňa použitie kladkového stroja s navijakmi nastavenými na najnižšiu výšku a potom kríženie rúk pred hrudníkom pri mierne ohnutých lakťoch."
  },
  "pec-deck-fly": {
    "name": "Rozpažovanie na Pec Deck stroji",
    "description": "Rozpažovanie na Pec Deck stroji je izolačné cvičenie, ktoré zacieľuje na svaly hrudníka pomocou Pec Deck stroja. Stroj tu slúži ako stabilizátor, zdôrazňujúc veľký a malý prsníkový sval v hrudníku. Toto izolačné cvičenie, ktoré kombinuje tlačové a stláčacie pohyby, pomáha rozvíjať a posilňovať svaly hrudníka."
  },
  "chest-dips": {
    "name": "Dipy na hrudník",
    "description": "Dipy na hrudník sú cvičenie s vlastnou hmotnosťou, ktoré zacieľuje na dolný hrudník, tricepsy a ramená. Toto cvičenie je vynikajúce na zvýšenie sily a svalovej hmoty v hornej časti tela."
  },
  "dumbbell-curl": {
    "name": "Bicepsový zdvih s činkami",
    "description": "Bicepsový zdvih s činkami je izolačné cvičenie, ktoré zacieľuje na bicepsové svaly pomocou činiek, na budovanie svalov a sily v rukách. Cvičenie je možné vykonávať rôznymi spôsobmi, vrátane striedavého zdvíhania rúk alebo súčasného cvičenia oboch rúk."
  },
  "barbell-curl": {
    "name": "Bicepsový zdvih s hriadeľovou činkou",
    "description": "Bicepsový zdvih s hriadeľovou činkou je izolačné cvičenie, ktoré zacieľuje na bicepsové svaly v hornej časti rúk pomocou hriadeľovej činky. Toto cvičenie sa zvyčajne vykonáva v stoji s nohami na šírku ramien a hriadeľovou činkou drženou na dĺžku rúk pred telom."
  },
  "hammer-curl": {
    "name": "Kladivový zdvih",
    "description": "Kladivový zdvih je izolačné cvičenie, ktoré zacieľuje na bicepsové svaly, najmä na brachialis a brachioradialis svaly, pomocou činiek. Cvičenie sa vykonáva držaním činiek neutrálnym úchopom (dlaňami smerujúcimi k sebe) a ich zdvíhaním smerom k ramenám."
  },
  "cable-hammer-curl": {
    "name": "Kladivový zdvih s lanom",
    "description": "Kladivový zdvih s lanom je izolačné cvičenie, ktoré zacieľuje na bicepsové svaly, najmä na brachialis a brachioradialis svaly, pomocou kladkového stroja s lanom. Cvičenie sa vykonáva stojac s nohami na šírku ramien a držaním lana kladky neutrálnym úchopom (dlaňami smerujúcimi k sebe), pričom sa lano zdvíha smerom k ramenám."
  },
  "cable-biceps-curl": {
    "name": "Bicepsový zdvih na kladke",
    "description": "Bicepsový zdvih na kladke je izolačné cvičenie, ktoré zacieľuje na bicepsové svaly pomocou kladkového stroja. Cvičenie sa vykonáva stojac s nohami na šírku ramien a držaním rukoväte kladky s dlaňami smerujúcimi nahor."
  },
  "incline-biceps-curl": {
    "name": "Bicepsový zdvih na šikmej lavičke s činkami",
    "description": "Bicepsový zdvih na šikmej lavičke s činkami je izolačné cvičenie, ktoré zacieľuje na bicepsové svaly pomocou činiek pri ležaní na šikmej lavičke. Cvičenie sa vykonáva sedením na šikmej lavičke nastavenou v uhle 45 stupňov a držaním činiek s dlaňami smerujúcimi nahor a zdvíhaním závaží smerom k ramenám, jednu ruku naraz."
  },
  "z-bar-curl": {
    "name": "Z-hriadeľový bicepsový zdvih",
    "description": "Z-hriadeľový bicepsový zdvih je izolačné cvičenie, ktoré zacieľuje na bicepsové svaly v hornej časti rúk pomocou Z-hriadeľovej činky. Toto cvičenie sa zvyčajne vykonáva v stoji s nohami na šírku ramien a Z-hriadeľovou činkou drženou na dĺžku rúk pred telom."
  },
  "squat": {
    "name": "Drepy",
    "description": "Drep je základné cvičenie dolnej časti tela zamerané na štvorhlavý sval, ohýbače kolien a sedacie svaly. Je to komplexné cvičenie, čo znamená, že súčasne pracuje na viacerých svalových skupinách. Cvičenie sa vykonáva pomocou hriadeľovej činky, ktorá je dlhá, rovná tyč zaťažená kotúčmi."
  },
  "hack-squats": {
    "name": "Hack drepy",
    "description": "Hack drepy sú komplexné cvičenie, ktoré zacieľuje na kvadricepsy, hamstringy a sedacie svaly pomocou hack squat stroja. Cvičenie sa vykonáva tak, že stojíte na platforme stroja s ramenami pod vankúšmi a potom drepnete dolu, pričom chrbát držíte opretý o operadlo."
  },
  "smith-squats": {
    "name": "Drepy na Smithovom stroji",
    "description": "Drepy na Smithovom stroji sú variáciou tradičného drepu, ktorý sa vykonáva pomocou Smithovho stroja. Smithov stroj je zariadenie, ktoré obsahuje činku pevne umiestnenú v oceľových koľajniciach, čo umožňuje vertikálny pohyb a poskytuje stabilitu a podporu počas cvičenia."
  },
  "leg-curl": {
    "name": "Zakopávanie na stroji",
    "description": "Zakopávanie na stroji je izolačné cvičenie, ktoré zacieľuje na hamstringy pomocou stroja na zakopávanie. Cvičenie sa vykonáva ležaním na bruchu na lavici stroja s členkami pod valcom a potom ohýbaním kolien, pričom zdvíhate závažie smerom k sedacím svalom."
  },
  "leg-extension": {
    "name": "Predkopávanie na stroji",
    "description": "Predkopávanie na stroji je izolačné cvičenie, ktoré zacieľuje na kvadricepsy pomocou stroja na predkopávanie. Cvičenie sa vykonáva sedením na lavici stroja s členkami pod valcom a potom vystieraním nôh, pričom zdvíhate závažie smerom nahor."
  },
  "leg-press": {
    "name": "Tlak na nohy",
    "description": "Tlak na nohy je komplexné cvičenie, ktoré zacieľuje na kvadricepsy, hamstringy a sedacie svaly pomocou stroja leg press. Cvičenie sa vykonáva sedením na lavici stroja s nohami na platforme a potom tlačením platformy od tela, pričom vystierate nohy."
  },
  "lunges": {
    "name": "Výpady",
    "description": "Výpady sú komplexné cvičenie, ktoré zacieľuje na kvadricepsy, hamstringy a sedacie svaly pomocou činiek. Cvičenie sa vykonáva tak, že urobíte krok vpred jednou nohou a znížite telo dolu, kým zadné koleno takmer nedotkne zem, a potom sa vrátite do východiskovej pozície."
  },
  "deadlift": {
    "name": "Mŕtvy ťah",
    "description": "Mŕtvy ťah je komplexné cvičenie, ktoré zacieľuje na celý zadný reťazec, vrátane chrbta, sedacích svalov a ohýbačov kolien."
  },
  "lat-pulldown": {
    "name": "Sťahovanie kladky na chrbát",
    "description": "Sťahovanie kladky na chrbát je cvičenie, ktoré zacieľuje na široké svaly chrbta."
  },
  "seated-cable-row": {
    "name": "Veslovanie na kladke v sede",
    "description": "Veslovanie na kladke v sede je cvičenie, ktoré zacieľuje na svaly hornej časti chrbta a bicepsy."
  },
  "closegrip-cable-row": {
    "name": "Veslovanie na kladke s úzkym úchopom",
    "description": "Veslovanie na kladke s úzkym úchopom je cvičenie, ktoré zacieľuje na strednú časť chrbta a bicepsy pomocou úzkeho úchopu."
  },
  "assisted-pull-up": {
    "name": "Asistovaný príťah na hrazde",
    "description": "Asistovaný príťah na hrazde je cvičenie, ktoré zacieľuje na hornú časť chrbta a bicepsy pomocou asistovaného príťahu na hrazde alebo odporových pásov, ktoré poskytujú podporu počas pohybu."
  },
  "dumbbell-row": {
    "name": "Veslovanie s činkami",
    "description": "Veslovanie s činkami je cvičenie, ktoré cieli na svaly hornej časti chrbta a bicepsy pomocou činiek. Cvičenie sa vykonáva tak, že sa predkloníte v páse s jednou rukou opretou o lavičku a druhou rukou držíte činku, potom priťahujete činku smerom k trupu."
  },
  "pull-up": {
    "name": "Príťah na hrazde",
    "description": "Príťah na hrazde je cvičenie s vlastnou váhou, ktoré cieli na široké svaly chrbta a bicepsy. Cvičenie sa vykonáva tak, že sa zavesíte na hrazdu a priťahujete telo nahor, kým nie je brada nad hrazdou."
  },
  "pushdown": {
    "name": "Káblové stláčanie na tricepsy",
    "description": "Káblové stláčanie na tricepsy je izolačné cvičenie, ktoré zacieľuje na tricepsové svaly pomocou kladkového stroja. Zameriava sa na triceps brachii, s dôrazom na laterálnu a dlhú hlavu."
  },
  "push-down": {
    "name": "Stláčanie na tricepsy",
    "description": "Stláčanie na tricepsy je izolačné cvičenie, ktoré zacieľuje na tricepsové svaly pomocou kladkového stroja. Tento pohyb sa zvyčajne vykonáva pomocou kladkového stroja s priamou tyčou alebo V-tyčovým príslušenstvom."
  },
  "incline-ezbar-triceps": {
    "name": "Tricepsové predlžovanie na šikmej lavičke s EZ-hriadeľou",
    "description": "Tricepsové predlžovanie na šikmej lavičke s EZ-hriadeľou je cvičenie, ktoré zacieľuje na tricepsové svaly pomocou EZ-hriadeľovej činky pri ležaní na šikmej lavičke. Hlavným cieľom pohybu tricepsového predlžovania na šikmej lavičke s EZ-hriadeľou je triceps brachii sval. Cvičenie sa vykonáva ležaním na šikmej lavičke nastavenou v uhle 30-45 stupňov a držaním EZ-hriadeľovej činky s nadhmatom (dlaňami smerujúcimi nadol) a predlžovaním rúk nahor."
  },
  "onearm-triceps-pushdown": {
    "name": "Jednoručné stláčanie na tricepsy",
    "description": "Jednoručné stláčanie na tricepsy je cvičenie, ktoré zacieľuje na tricepsové svaly pomocou kladkového stroja. Hlavným cieľom pohybu jednoručného stláčania na tricepsy je triceps brachii sval. Cvičenie sa vykonáva stojac s nohami na šírku ramien a držaním rukoväte kladky s nadhmatom (dlaňou smerujúcou nadol) a predlžovaním ruky nadol."
  },
  "seated-dumbbell-triceps-extension": {
    "name": "Sediace tricepsové predpažovanie s činkou",
    "description": "Sediace tricepsové predpažovanie s činkou je cvičenie, ktoré cieli na tricepsové svaly pomocou činky pri sedení. Hlavným cieľom pohybu sediaceho tricepsového predpažovania s činkou je triceps brachii sval. Cvičenie sa vykonáva sedením na lavičke s nohami na šírku ramien a držaním činky s nadhmatom (dlaňami smerujúcimi nadol) a predpažovaním rúk nahor."
  },
  "lying-barbell-tricep-extension": {
    "name": "Ležiace tricepsové predpažovanie s hriadeľovou činkou",
    "description": "Ležiace tricepsové predpažovanie s hriadeľovou činkou je cvičenie, ktoré zacieľuje na tricepsové svaly pomocou hriadeľovej činky pri ležaní na vodorovnej lavičke. Hlavným cieľom pohybu ležiaceho tricepsového predpažovania s hriadeľovou činkou je triceps brachii sval. Cvičenie sa vykonáva ležaním na vodorovnej lavičke a držaním hriadeľovej činky s nadhmatom (dlaňami smerujúcimi nadol) a predpažovaním rúk nahor."
  },
  "dumbbell-skull-crushers": {
    "name": "Tricepsové predlžovanie s činkami",
    "description": "Tricepsové predlžovanie s činkami je izolačné cvičenie, ktoré zacieľuje na tricepsové svaly pomocou činiek. Hlavným cieľom pohybu tricepsového predlžovania s činkami je triceps brachii sval. Cvičenie sa vykonáva ležaním na vodorovnej lavičke a držaním činiek s nadhmatom (dlaňami smerujúcimi nadol) a predlžovaním rúk nahor."
  },
  "triceps-dips": {
    "name": "Dipy na tricepsy",
    "description": "Dipy na tricepsy sú cvičenie s vlastnou hmotnosťou, ktoré zacieľuje na tricepsové svaly, ramená a hrudník. Hlavným cieľom pohybu dipov na tricepsy je triceps brachii sval."
  },
  "dumbbell-lateral-raise": {
    "name": "Bočné zdvihy s činkami",
    "description": "Bočné zdvihy s činkami sú izolačné cvičenie, ktoré zacieľuje na ramenné svaly pomocou činiek."
  },
  "cable-lateral-raise": {
    "name": "Bočné zdvihy na kladce",
    "description": "Bočné zdvihy na kladke sú cvičenie, ktoré zacieľuje na ramenné svaly pomocou kladkového stroja. Bočné zdvihy na kladke zahŕňajú zdvíhanie paže do strany pomocou nízkej kladky a úchytu. Toto cvičenie poskytuje konštantné napätie na ramenné svaly počas pohybu, čo z neho robí efektívny spôsob, ako budovať silu a definíciu v ramenách."
   },
   "front-raise": {
     "name": "Predné zdvihy s činkami",
     "description": "Predné zdvihy s činkami sú izolačné cvičenie, ktoré zacieľuje na ramenné svaly pomocou činiek. Hlavným cieľom pohybu predných zdvihov s činkami sú deltové svaly, s dôrazom na predný deltový sval. Cvičenie sa vykonáva státím s nohami na šírku ramien a držaním činiek v úrovni stehien s dlaňami smerujúcimi k telu, potom sa činky zdvíhajú pred telo, kým nie sú paže rovnobežné s podlahou."
   },
   "dumbbell-shoulder-press": {
     "name": "Tlaky na ramená s činkami",
     "description": "Tlaky na ramená s činkami sú komplexné cvičenie, ktoré zacieľuje na ramenné svaly pomocou činiek. Hlavným cieľom pohybu tlakov na ramená s činkami sú deltové svaly, s dôrazom na predný deltový sval. Cvičenie sa vykonáva sedením alebo státím s nohami na šírku ramien a držaním činiek v úrovni ramien s dlaňami smerujúcimi dopredu, potom sa činky tlačia nad hlavu, kým nie sú paže úplne vystreté."
   },
   "lever-shoulder-press": {
     "name": "Tlaky na ramená na pákovom stroji",
     "description": "Tlaky na ramená na pákovom stroji sú komplexné cvičenie, ktoré zacieľuje na ramenné svaly pomocou pákového stroja. Hlavným cieľom pohybu tlakov na ramená na pákovom stroji sú deltové svaly, s dôrazom na predný deltový sval. Cvičenie sa vykonáva sedením na stroji s nohami plochými na podlahe a držaním rukovätí v úrovni ramien, potom sa rukoväte tlačia nad hlavu, kým nie sú paže úplne vystreté."
   },
   "military-press": {
     "name": "Vojenské tlaky",
     "description": "Vojenské tlaky sú komplexné cvičenie, ktoré zacieľuje na ramenné svaly pomocou hriadeľovej činky. Hlavným cieľom pohybu vojenských tlakov sú deltové svaly, s dôrazom na predný deltový sval. Cvičenie sa vykonáva v stoji s nohami na šírku ramien a držaním hriadeľovej činky v úrovni ramien s dlaňami smerujúcimi dopredu, potom sa činka tlačí nad hlavu, kým nie sú paže úplne vystreté."
   },
   "rear-delt-fly": {
    "name": "Zadné deltové rozpažovanie",
    "description": "Zadné deltové rozpažovanie je izolačné cvičenie, ktoré cieli na zadné deltové svaly pomocou činiek. Cvičenie sa vykonáva tak, že sa predkloníte v páse s činkami v rukách a potom zdvíhate ruky do strán, kým nie sú paže rovnobežné s podlahou."
   },
   "seated-barbell-shoulder-press": {
     "name": "Tlaky na ramená s hriadeľovou činkou v sede",
     "description": "Tlaky na ramená s hriadeľovou činkou v sede sú komplexné cvičenie, ktoré cieli na ramenné svaly pomocou hriadeľovej činky pri sedení. Hlavným cieľom pohybu tlakov na ramená s hriadeľovou činkou v sede sú deltové svaly, s dôrazom na predný deltový sval. Cvičenie sa vykonáva sedením na lavičke s nohami na šírku ramien a držaním hriadeľovej činky v úrovni ramien s dlaňami smerujúcimi dopredu, potom sa činka tlačí nad hlavu, kým nie sú paže úplne vystreté."
   }
}
