{
  "muscleGroups": {
    "chest": "Hrudník",
    "legs": "Nohy",
    "back": "Chrbát",
    "shoulders": "Ramená",
    "biceps": "Biceps",
    "triceps": "Triceps",
    "abs": "Brušné svaly",
    "forearms": "Predlaktia"
  },
  "equipment": {
    "bodyweight": "Vlastná váha",
    "bench": "Lavica",
    "dumbbell": "Činka",
    "barbell": "Hriadeľová činka",
    "kettlebell": "Kettlebell",
    "machine": "Stroj",
    "pull-up-bar": "Hrazda",
    "cable": "Kábel",
    "none": "Žiadne"
  },
  "bench-press": {
    "name": "Tlaky na lavičke",
    "description": "Tlaky na lavičke sú komplexné cvičenie, ktoré zacieľuje na hrudník, ramená a tricepsy."
  },
  "push-up": {
    "name": "Kliky",
    "description": "Kliky sú cvičenie s vlastnou hmotnosťou, ktoré posilňuje hrudník, ramená a jadro."
  },
  "dumbbell-bench-press": {
    "name": "Tlaky na lavičke s činkami",
    "description": "Tlaky na lavičke s činkami sú komplexné cvičenie, ktoré zacieľuje na hrudník, ramená a tricepsy pomocou činiek."
  },
  "dumbbell-fly": {
    "name": "Rozpažovanie s činkami",
    "description": "Rozpažovanie s činkami je izolačné cvičenie, ktoré zacieľuje na svaly hrudníka pomocou činiek."
  },
  "dumbbell-incline-press": {
    "name": "Tlaky na šikmej lavičke s činkami",
    "description": "Tlaky na šikmej lavičke s činkami sú komplexné cvičenie, ktoré zacieľuje na horný hrudník, ramená a tricepsy pomocou činiek."
  },
  "high-cable-crossover": {
    "name": "Vysoký kríž na kladke",
    "description": "Vysoký kríž na kladke je izolačné cvičenie, ktoré zacieľuje na horné svaly hrudníka pomocou kladkového stroja."
  },
   "low-cable-crossover": {
    "name": "Nízky kríž na kladke",
    "description": "Nízky kríž na kladke je izolačné cvičenie, ktoré zacieľuje na dolné svaly hrudníka pomocou kladkového stroja."
  },
  "pec-deck-fly": {
    "name": "Rozpažovanie na Pec Deck stroji",
    "description": "Rozpažovanie na Pec Deck stroji je izolačné cvičenie, ktoré zacieľuje na svaly hrudníka pomocou Pec Deck stroja."
  },
  "chest-dips": {
    "name": "Dipy na hrudník",
    "description": "Dipy na hrudník sú cvičenie s vlastnou hmotnosťou, ktoré zacieľuje na dolný hrudník, tricepsy a ramená."
  },
  "squat": {
    "name": "Drepy",
    "description": "Drep je základné cvičenie dolnej časti tela zamerané na štvorhlavý sval, ohýbače kolien a sedacie svaly."
  },
  "deadlift": {
    "name": "Mŕtvy ťah",
    "description": "Mŕtvy ťah je komplexné cvičenie, ktoré zacieľuje na celý zadný reťazec, vrátane chrbta, sedacích svalov a ohýbačov kolien."
  },
  "lat-pulldown": {
    "name": "Sťahovanie kladky na chrbát",
    "description": "Sťahovanie kladky na chrbát je cvičenie, ktoré zacieľuje na široké svaly chrbta."
  },
  "seated-cable-row": {
    "name": "Veslovanie na kladke v sede",
    "description": "Veslovanie na kladke v sede je cvičenie, ktoré zacieľuje na svaly hornej časti chrbta a bicepsy."
  },
  "closegrip-cable-row": {
    "name": "Veslovanie na kladke s úzkym úchopom",
    "description": "Veslovanie na kladke s úzkym úchopom je cvičenie, ktoré zacieľuje na strednú časť chrbta a bicepsy pomocou úzkeho úchopu."
  },
  "pushdown": {
    "name": "Stláčanie kladky na tricepsy",
    "description": "Stláčanie kladky na tricepsy je izolačné cvičenie, ktoré zacieľuje na tricepsové svaly pomocou kladkového stroja."
  },
  "dumbbell-curl": {
    "name": "Bicepsový zdvih s činkami",
    "description": "Bicepsový zdvih s činkami je izolačné cvičenie, ktoré zacieľuje na bicepsové svaly pomocou činiek."
  },
  "barbell-curl": {
    "name": "Bicepsový zdvih s hriadeľovou činkou",
    "description": "Bicepsový zdvih s hriadeľovou činkou je izolačné cvičenie, ktoré zacieľuje na bicepsové svaly pomocou hriadeľovej činky."
  },
  "dumbbell-lateral-raise": {
    "name": "Bočné zdvihy s činkami",
    "description": "Bočné zdvihy s činkami sú izolačné cvičenie, ktoré zacieľuje na ramenné svaly pomocou činiek."
  }
}
